[
    {"id":1,
     "name":"Sir C V Raman",
     "image":"https://upload.wikimedia.org/wikipedia/commons/e/e6/Sir_CV_Raman.JPG",
     "description":"In this Indian name, the name Chandrasekhara is a patronymic, not a family name, and the person should be referred to by the given name, Raman.Sir Chandrasekhara Raman(7 November 1888 – 21 November 1970) was an Indian physicist, born in the former Madras Province, whose ground breaking work in the field of light scattering earned him the 1930 Nobel Prize for Physics. He discovered that, when light traverses a transparent material, some of the deflected light changes in wavelength. This phenomenon is now called Raman scattering and is the result of the Raman effect.[3] In 1954, he was honoured with the highest civilian award in India, the Bharat Ratna."
     },
    {
        "id":2,
        "name":"Father Of Nation Gandhi",
        "image":"https://upload.wikimedia.org/wikipedia/commons/d/d1/Portrait_Gandhi.jpg",
        "description":"Born and raised in a Hindu merchant caste family in coastal Gujarat, western India, and trained in law at the Inner Temple, London, Gandhi first employed nonviolent civil disobedience as an expatriate lawyer in South Africa, in the resident Indian community's struggle for civil rights. After his return to India in 1915, he set about organising peasants, farmers, and urban labourers to protest against excessive land-tax and discrimination. Assuming leadership of the Indian National Congress in 1921, Gandhi led nationwide campaigns for easing poverty, expanding women's rights, building religious and ethnic amity, ending untouchability, but above all for achieving Swaraj or self-rule.Gandhi famously led Indians in challenging the British-imposed salt tax with the 400 km (250 mi) Dandi Salt March in 1930, and later in calling for the British to Quit India in 1942. He was imprisoned for many years, upon many occasions, in both South Africa and India. Gandhi attempted to practise nonviolence and truth in all situations, and advocated that others do the same. He lived modestly in a self-sufficient residential community and wore the traditional Indian dhoti and shawl, woven with yarn hand-spun on a charkha. He ate simple vegetarian food, and also undertook long fasts as a means of both self-purification and social protest.Gandhi's vision of an independent India based on religious pluralism, however, was challenged in the early 1940s by a new Muslim nationalism which was demanding a separate Muslim homeland carved out of India.[9] Eventually, in August 1947, Britain granted independence, but the British Indian Empire was partitioned into two dominions, a Hindu-majority India and Muslim Pakistan.[10] As many displaced Hindus, Muslims, and Sikhs made their way to their new lands, religious violence broke out, especially in the Punjab and Bengal. Eschewing the official celebration of independence in Delhi, Gandhi visited the affected areas, attempting to provide solace. In the months following, he undertook several fasts unto death to promote religious harmony. The last of these, undertaken on 12 January 1948 at age 78,[11] also had the indirect goal of pressuring India to pay out some cash assets owed to Pakistan.[11] Some Indians thought Gandhi was too accommodating.[11][12] Nathuram Godse, a Hindu nationalist, assassinated Gandhi on 30 January 1948 by firing three bullets into his chest at point-blank range.His birthday, 2 October, is commemorated as Gandhi Jayanti, a national holiday, and world-wide as the International Day of Nonviolence."
    },
    {
        "id":3,
        "name":"Sir Bhagat Singh",
        "image":"https://upload.wikimedia.org/wikipedia/commons/9/9b/Bhagat_Singh_1929_140x190.jpg",
        "description":"Bhagat Singh (23 March 1931) was an Indian revolutionary socialist who was influential in the Indian independence movement. Born into a Punjabi Sikh family which had earlier been involved in revolutionary activities against the British Raj, he studied European revolutionary movements as a teenager and was attracted to anarchist and Marxist ideologies. He worked with several revolutionary organisations and became prominent in the Hindustan Republican Association (HRA), which changed its name to the Hindustan Socialist Republican Association (HSRA) in 1928.Seeking revenge for the death of Lala Lajpat Rai, Singh assassinated John Saunders, a British police officer. He eluded efforts by the police to capture him. Soon after, he and Batukeshwar Dutt threw two bombs and leaflets inside the Central Legislative Assembly, and offered themselves for arrest. Held in jail on a charge of murder, he gained widespread national support when he undertook a 116-day hunger strike demanding equal rights for European prisoners, and those Indians imprisoned for what he believed were political reasons. During this period, sufficient evidence was brought against him for a conviction in the Saunders case after trial by Special Tribunal, and an appeal to the Privy Council in England. He was convicted and hanged for his participation in the assassination, at the age of 23.His legacy prompted youth in India to continue fighting for independence and he remains an influence on some young people in modern India, as well as the inspiration for several films. He is commemorated with a range of memorials including a large bronze statue in the Parliament of India."
    }
    
]